浅谈Python写中的正则表达式.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-11-10 二 15:31 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>浅谈Python写中的正则表达式</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Evan Meek">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">浅谈Python写中的正则表达式</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb68b8d9">compile()</a></li>
<li><a href="#org23d4c59">search()</a></li>
<li><a href="#org415ab1b">match()</a></li>
<li><a href="#orga0db5d1">split()</a></li>
<li><a href="#org19a595b">findall()</a></li>
<li><a href="#orgef56370">sub()</a></li>
<li><a href="#org70deae0">escape()</a></li>
</ul>
</div>
</div>
<p>
Hey, 欢迎回来！这里是美味的樱桃菌，今天咱们来谈谈Python中的正则表达式。
</p>

<p>
Python中的正则是由`re`模块提供的。
</p>

<p>
`re`模块中提供很多有用的函数。
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">函数</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">compile(pattern[, flags])</td>
<td class="org-left">根据包含正则表达式的字符串创建模式对象</td>
</tr>

<tr>
<td class="org-left">search(pattern, string[, flags])</td>
<td class="org-left">在字符串中查找模式</td>
</tr>

<tr>
<td class="org-left">match(pattern, string[, flags])</td>
<td class="org-left">在字符串开头查找模式</td>
</tr>

<tr>
<td class="org-left">split(pattern,string[, maxsplit=0])</td>
<td class="org-left">根据模式来分割字符串</td>
</tr>

<tr>
<td class="org-left">findall(pattern, string)</td>
<td class="org-left">返回一个列表，其中包含字符串中所有与模式匹配的字符串</td>
</tr>

<tr>
<td class="org-left">sub(pat, repl, string[, count=0])</td>
<td class="org-left">将字符串中与模式pat匹配的字串都替换为repl</td>
</tr>

<tr>
<td class="org-left">escape(string)</td>
<td class="org-left">对字符串中所有的正则表达式特殊字符都进行转义</td>
</tr>
</tbody>
</table>

<div id="outline-container-orgb68b8d9" class="outline-2">
<h2 id="orgb68b8d9">compile()</h2>
<div class="outline-text-2" id="text-orgb68b8d9">
<p>
  compile() 用于将其参量parrtern(string)转换为一个模式对象。
  这样的好处在于，如果直接将一个字符串传递给search()函数，那么search()内部会将字符串转换为模式对象后再进行下一步。所以
如果提前对一些常用的正则表达式字符串转换为模式对象，那么就会提高search()的查询效率。
</p>
</div>
</div>
<div id="outline-container-org23d4c59" class="outline-2">
<h2 id="org23d4c59">search()</h2>
<div class="outline-text-2" id="text-org23d4c59">
<p>
  search() 用于查找其参量pattern(string)与参量string匹配的第一个字符子串，如果找到则返回子串，这个子串是MatchObject对象
的，如果没有找到则返回None。
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #73777D; font-style: italic;">import</span> re

<span style="color: #007BD9;">pattern</span> = <span style="color: #008FAC;">"python"</span>
<span style="color: #007BD9;">string</span> = <span style="color: #008FAC;">"www.python.org"</span>
<span style="color: #73777D; font-style: italic;">if</span> re.search<span style="color: #5A5E65;">(</span>pattern,string<span style="color: #5A5E65;">)</span>:
    <span style="color: #73777D; font-style: italic;">print</span><span style="color: #5A5E65;">(</span><span style="color: #008FAC;">"Found it."</span><span style="color: #5A5E65;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org415ab1b" class="outline-2">
<h2 id="org415ab1b">match()</h2>
<div class="outline-text-2" id="text-org415ab1b">
<p>
跟search()类似，不过其仅作用于参量string的开头，如果参量pattern与参量string的开头匹配的话，那么就返回MatchObject对象，
否则返回None。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #73777D; font-style: italic;">import</span> re

<span style="color: #007BD9;">pattern</span> = <span style="color: #008FAC;">"p"</span>
<span style="color: #007BD9;">string</span> = <span style="color: #008FAC;">"python"</span>
<span style="color: #73777D; font-style: italic;">if</span> re.match<span style="color: #5A5E65;">(</span>pattern, string<span style="color: #5A5E65;">)</span>:
    <span style="color: #73777D; font-style: italic;">print</span><span style="color: #5A5E65;">(</span><span style="color: #008FAC;">"Found it!"</span><span style="color: #5A5E65;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga0db5d1" class="outline-2">
<h2 id="orga0db5d1">split()</h2>
<div class="outline-text-2" id="text-orga0db5d1">
<p>
用于将参量pattern(string)与参量string进行匹配，然后通过匹配的子串进行分割string。
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #73777D; font-style: italic;">import</span> re

<span style="color: #007BD9;">pattern</span> = <span style="color: #008FAC;">"[,]+"</span>
<span style="color: #007BD9;">string</span> = <span style="color: #008FAC;">"Hello,My name is EvanMeek,Nice to meet you"</span>

<span style="color: #007BD9;">string</span> = re.split<span style="color: #5A5E65;">(</span>pattern, string<span style="color: #5A5E65;">)</span>
<span style="color: #73777D; font-style: italic;">print</span><span style="color: #5A5E65;">(</span>string<span style="color: #5A5E65;">)</span>
</pre>
</div>

<p>
还可以指定参量maxsplit，其作用是设置最大分割次数。
</p>

<blockquote>
<p>
如果在pattern内包含括号，那么括号内的内容就会被插入至被分割的子串之间。
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #73777D; font-style: italic;">import</span> re
<span style="color: #007BD9;">pattern</span> = <span style="color: #008FAC;">"o(o)+"</span>
<span style="color: #007BD9;">string</span> = <span style="color: #008FAC;">"FoooooBar"</span>
<span style="color: #007BD9;">string</span> = re.split<span style="color: #5A5E65;">(</span>pattern, string<span style="color: #5A5E65;">)</span>
<span style="color: #73777D; font-style: italic;">print</span><span style="color: #5A5E65;">(</span>string<span style="color: #5A5E65;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org19a595b" class="outline-2">
<h2 id="org19a595b">findall()</h2>
<div class="outline-text-2" id="text-org19a595b">
<p>
findall()会将匹配的所有的子串生成一个列表。
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #73777D; font-style: italic;">import</span> re

<span style="color: #007BD9;">pattern</span> = <span style="color: #008FAC;">"[a-zA-Z]+"</span>
<span style="color: #007BD9;">string</span> = <span style="color: #008FAC;">"Hmm...You really thing so?"</span>
<span style="color: #73777D; font-style: italic;">print</span><span style="color: #5A5E65;">(</span>re.findall<span style="color: #007BD9;">(</span>pattern, string<span style="color: #007BD9;">)</span><span style="color: #5A5E65;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef56370" class="outline-2">
<h2 id="orgef56370">sub()</h2>
<div class="outline-text-2" id="text-orgef56370">
<p>
sub()可以将匹配到的子串从左往右依次用参量repl替换掉。
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #73777D; font-style: italic;">import</span> re

<span style="color: #007BD9;">pat</span> = <span style="color: #008FAC;">"{name}"</span>
<span style="color: #007BD9;">repl</span>= <span style="color: #008FAC;">"EvanMeek"</span>
<span style="color: #007BD9;">string</span> = <span style="color: #008FAC;">"Hi, Your name is {name}?\nYes! My name is {name}."</span>
<span style="color: #73777D; font-style: italic;">print</span><span style="color: #5A5E65;">(</span>re.sub<span style="color: #007BD9;">(</span>pat, repl, string<span style="color: #007BD9;">)</span><span style="color: #5A5E65;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org70deae0" class="outline-2">
<h2 id="org70deae0">escape()</h2>
<div class="outline-text-2" id="text-org70deae0">
<p>
escape()会把参量string中所有包含正则表达式特殊字符的都进行转义，就像这样:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #73777D; font-style: italic;">import</span> re

<span style="color: #73777D; font-style: italic;">print</span><span style="color: #5A5E65;">(</span>re.escape<span style="color: #007BD9;">(</span><span style="color: #008FAC;">"www.python.org"</span><span style="color: #007BD9;">)</span><span style="color: #5A5E65;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-08-19 三 00:00</p>
<p class="author">Author: Evan Meek</p>
<p class="date">Created: 2020-11-10 二 15:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
